Обработки/Reports/_СтоимостьЧистыхАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_СтоимостьЧистыхАктивов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДоговоровДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_СтоимостьЧистыхАктивов/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ЗаполнитьВариантыОтчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьНастройки(Команда)
	
	Элементы.ФормаКомандаПоказатьНастройки.Пометка = НЕ Элементы.ФормаКомандаПоказатьНастройки.Пометка;
	
	НастройкаВидимостиИДоступности(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастройкаВидимостиИДоступности(Форма)
	
	Элементы	= Форма.Элементы;
	Отчет		= Форма.Отчет;
	
	Элементы.ГруппаНастройки.Видимость		= Элементы.ФормаКомандаПоказатьНастройки.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда	
		СформироватьНаСервере(); 
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат);
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Расшифровка);
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	РеквизитОтчет = РеквизитФормыВЗначение("Отчет");
	РеквизитОтчет.СформироватьОтчет(Результат, Расшифровка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
	Для Каждого ЗначениеПеречисления из Перечисления.ВидыДоговоровДоверительногоУправления Цикл 
		Если Отчет.ВидыДоговоровДоверительногоУправления.НайтиПоЗначению(ЗначениеПеречисления) = Неопределено Тогда
			Отчет.ВидыДоговоровДоверительногоУправления.Добавить(ЗначениеПеречисления,, Истина);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВариантыОтчетов()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Для Каждого Макет Из ОтчетОбъект.Метаданные().Макеты Цикл
		Элементы.ВариантОтчета.СписокВыбора.Добавить(Макет.Имя, Макет.Синоним);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Расшифровка, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтчетаПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Расшифровка, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ВидыДоговоровДоверительногоУправленияЗначениеПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Расшифровка, "НеАктуальность");
КонецПроцедуры
